# GetCustomObjectSelectionGroup

## Description
Access the handle to selection group. This group contains geometry that defines the selection and pre-selection indication of this object.

```pascal
FUNCTION GetCustomObjectSelectionGroup(objectHand : HANDLE) : HANDLE;
```

```python

def vs.GetCustomObjectSelectionGroup(objectHand):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHand|HANDLE|Handle to custom object.|

## Returns
Returns a HANDLE to the selection group.

## Version
Availability: from Vectorworks 2009
## Category
* Objects - Custom